greggersaurus/OpenSteamController/Firmware/WipExplorations/FauxControllers/src/cr_startup_lpc11xx.c
    0, 				                     	// Reserved
    0, 				                     	// Reserved
    0, 				                     	// Reserved
    TIMER16_0_IRQHandler,                   // CT16B0 (16-bit Timer 0)
    TIMER16_1_IRQHandler,                   // CT16B1 (16-bit Timer 1)
    TIMER32_0_IRQHandler,                   // CT32B0 (32-bit Timer 0)
    TIMER32_1_IRQHandler,                   // CT32B1 (32-bit Timer 1)
    SSP0_IRQHandler,                      	// SPI/SSP0 Interrupt
    UART_IRQHandler,                      	// UART0

    0, 				                     	// Reserved
    0,                      				// Reserved

    ADC_IRQHandler,                      	// ADC   (A/D Converter)
    WDT_IRQHandler,                      	// WDT   (Watchdog Timer)
    BOD_IRQHandler,                      	// BOD   (Brownout Detect)
    0,                      				// Reserved
    0, 				                     	// Reserved
    0, 				                     	// Reserved
    PIOINT1_IRQHandler,                     // PIO INT1
    PIOINT0_IRQHandler,                     // PIO INT0

#elif defined(CHIP_LPC11XXLV)
    // Wakeup sources for the I/O pins:
    //   PIO0 (0:11)
    //   PIO1 (0)
    WAKEUP_IRQHandler,                      // PIO0_0  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_1  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_2  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_3  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_4  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_5  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_6  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_7  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_8  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_9  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_10 Wakeup
    WAKEUP_IRQHandler,                      // PIO0_11 Wakeup
    WAKEUP_IRQHandler,                      // PIO1_0  Wakeup
    
    0, 				                     	// Reserved
    0,                      				// Reserved

    I2C_IRQHandler,                      	// I2C0
    TIMER16_0_IRQHandler,                   // CT16B0 (16-bit Timer 0)
    TIMER16_1_IRQHandler,                   // CT16B1 (16-bit Timer 1)
    TIMER32_0_IRQHandler,                   // CT32B0 (32-bit Timer 0)
    TIMER32_1_IRQHandler,                   // CT32B1 (32-bit Timer 1)
    SSP0_IRQHandler,                      	// SPI/SSP0 Interrupt
    UART_IRQHandler,                      	// UART0

    0, 				                     	// Reserved
    0,                      				// Reserved

    ADC_IRQHandler,                      	// ADC   (A/D Converter)
    WDT_IRQHandler,                      	// WDT   (Watchdog Timer)
    BOD_IRQHandler,                      	// BOD   (Brownout Detect)
	FMC_IRQHandler,                         // 16+27: IP2111 Flash Memory Controller
    PIOINT3_IRQHandler,                     // PIO INT3
    PIOINT2_IRQHandler,                     // PIO INT2
    PIOINT1_IRQHandler,                     // PIO INT1
    PIOINT0_IRQHandler,                     // PIO INT0

#elif defined(CHIP_LPC11AXX)
    // LPC11A specific handlers
	PIN_INT0_IRQHandler,          // 16+ 0: Pin interrupt
	PIN_INT1_IRQHandler,          // 16+ 1: Pin interrupt
	PIN_INT2_IRQHandler,          // 16+ 2: Pin interrupt
	PIN_INT3_IRQHandler,          // 16+ 3: Pin interrupt
	PIN_INT4_IRQHandler,          // 16+ 4: Pin interrupt
	PIN_INT5_IRQHandler,          // 16+ 5: Pin interrupt
	PIN_INT6_IRQHandler,          // 16+ 6: Pin interrupt
	PIN_INT7_IRQHandler,          // 16+ 7: Pin interrupt
	GINT0_IRQHandler,             // 16+ 8: Port interrupt
	GINT1_IRQHandler,             // 16+ 9: Port interrupt
	ACMP_IRQHandler,              // 16+10: Analog Comparator
	DAC_IRQHandler,               // 16+11: D/A Converter
	0,                            // 16+12: Reserved
	0,                            // 16+13: Reserved
	SSP1_IRQHandler,              // 16+14: SSP1
	I2C_IRQHandler,               // 16+15: I2C
	TIMER16_0_IRQHandler,         // 16+16: 16-bit Timer0
	TIMER16_1_IRQHandler,         // 16+17: 16-bit Timer1
	TIMER32_0_IRQHandler,         // 16+18: 32-bit Timer0
	TIMER32_1_IRQHandler,         // 16+19: 32-bit Timer1
	SSP0_IRQHandler,              // 16+20: SSP0
	USART_IRQHandler,             // 16+21: USART
	0,                            // 16+22: Reserved
	0,                            // 16+23: Reserved
	ADC_IRQHandler,               // 16+24: A/D Converter
	WDT_IRQHandler,               // 16+25: Watchdog Timer
	BOD_IRQHandler,               // 16+26: Brown Out Detect
	FMC_IRQHandler,               // 16+27: IP2111 Flash Memory Controller
	0,                            // 16+28: Reserved
	0,                            // 16+29: ReserveD
	0,                            // 16+30: Reserved
	0,                            // 16+31: Reserved

#elif defined(CHIP_LPC11CXX)
    // Wakeup sources for the I/O pins:
    //   PIO0 (0:11)
    //   PIO1 (0)
    WAKEUP_IRQHandler,                      // PIO0_0  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_1  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_2  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_3  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_4  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_5  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_6  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_7  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_8  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_9  Wakeup
    WAKEUP_IRQHandler,                      // PIO0_10 Wakeup
    WAKEUP_IRQHandler,                      // PIO0_11 Wakeup
    WAKEUP_IRQHandler,                      // PIO1_0  Wakeup
    
    CAN_IRQHandler,							// C_CAN Interrupt
    SSP1_IRQHandler, 						// SPI/SSP1 Interrupt
    I2C_IRQHandler,                      	// I2C0
    TIMER16_0_IRQHandler,                   // CT16B0 (16-bit Timer 0)
    TIMER16_1_IRQHandler,                   // CT16B1 (16-bit Timer 1)
    TIMER32_0_IRQHandler,                   // CT32B0 (32-bit Timer 0)
    TIMER32_1_IRQHandler,                   // CT32B1 (32-bit Timer 1)
    SSP0_IRQHandler,                      	// SPI/SSP0 Interrupt
    UART_IRQHandler,                      	// UART0

